app/controllers/friends_controller.rb

SELECT "users".* FROM "users" WHERE (id in (2))
SELECT "tablefriends".* FROM "tablefriends" WHERE "tablefriends"."id_acc" = $1  [["id_acc", 1]]
SELECT "tablefriends".* FROM "tablefriends" WHERE "tablefriends"."id_friend" = $1  [["id_friend", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "block_friends".* FROM "block_friends" WHERE "block_friends"."id_acc" = $1  [["id_acc", 1]]
---
  def index
    @users = User.where.not(id: current_user.id)

    @temp = Tablefriend.where(id_acc: current_user.id)
    friendArr = []
    @temp.each do |u|
      friendArr.push(u.id_friend)
    end

    @temp = Tablefriend.where(id_friend: current_user.id)
    @temp.each do |u|
      friendArr.push(u.id_acc)
    end

    @Tablefriends = User.where('id in (?)', friendArr)
    @block_friends = BlockFriend.where(id_acc: current_user.id)

INSERT INTO "tablefriends" ("id_acc", "id_friend", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_acc", 1], ["id_friend", 3], ["created_at", "2018-06-10 20:45:06.443094"], ["updated_at", "2018-06-10 20:45:06.443094"]]
---
  def addfriend
    @friend = Tablefriend.new(id_acc: current_user.id, id_friend: params[:id_friend])
    if @friend.save