app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE (id in (2,3))
SELECT "tablefriends".* FROM "tablefriends" WHERE "tablefriends"."id_acc" = $1  [["id_acc", 1]]
SELECT "tablefriends".* FROM "tablefriends" WHERE "tablefriends"."id_friend" = $1  [["id_friend", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    # @friends = User.where.not(id: current_user.id)
    @users = User.where.not(id: current_user.id)

    @temp = Tablefriend.where(id_acc: current_user.id)
    friendArr = []
    @temp.each do |u|
      friendArr.push(u.id_friend)
    end

    @temp = Tablefriend.where(id_friend: current_user.id)
    @temp.each do |u|
      friendArr.push(u.id_acc)
    end

    @friends = User.where('id in (?)', friendArr)

INSERT INTO "messages" ("subject", "body", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject", "a"], ["body", "a"], ["sender_id", 1], ["receiver_id", 3], ["created_at", "2018-06-10 20:45:14.966154"], ["updated_at", "2018-06-10 20:45:14.966154"]]
---
  def create
    # @message = Message.new(message_params)
    # @message.user_sender = current_user
    # if @message.save
    #   flash[:notice] = "Message was successfully sent"
    #   NotifierMailer.new_message(@message).deliver
    #   redirect_to messages_sent_path
    # else render 'new'
    # end
    params[:message][:receiver_id].each do |id|
      if !id.empty?
        @message = Message.new
        @message.sender_id = current_user.id
        @message.subject = params[:message][:subject]
        @message.body = params[:message][:body]
        @message.receiver_id = id
        if @message.save

SELECT "block_friends".* FROM "block_friends" WHERE "block_friends"."id_acc" = $1  [["id_acc", 1]]
SELECT "messages".* FROM "messages" WHERE (sender_id not in (0) and receiver_id = (1)) ORDER BY created_at DESC
SELECT COUNT(*) FROM "messages" WHERE "messages"."receiver_id" = $1 AND "messages"."read" = $2 AND (sender_id not in (0))  [["receiver_id", 1], ["read", "f"]]
---
  def inbox
    # NotifierMailer.welcome(current_user).deliver
    @temp = BlockFriend.where(id_acc: current_user.id)
    b_friendArr = []
    b_friendArr.push(0)
    @temp.each do |u|
      b_friendArr.push(u.id_friend)
    end

    @messages = Message.where('sender_id not in (?) and receiver_id = (?)',b_friendArr,current_user.id).all.order('created_at DESC')
    @count_unread_inbox = Message.where(receiver_id: current_user.id, read: false).where('sender_id not in (?)',b_friendArr).count

SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = $1 ORDER BY created_at DESC  [["sender_id", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."receiver_id" = $1 AND "messages"."read" = $2  [["receiver_id", 1], ["read", "f"]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."sender_id" = $1 AND "messages"."read" = $2  [["sender_id", 1], ["read", "f"]]
---
  def sent
    @messages = Message.where(sender_id: current_user.id).all.order('created_at DESC')
    @count_unread_inbox = Message.where(receiver_id: current_user.id, read: false).count
    @count_unread_sent = Message.where(sender_id: current_user.id, read: false).count