app/controllers/myfiles_controller.rb

SELECT "myfiles".* FROM "myfiles" ORDER BY created_at DESC
SELECT COUNT(*) FROM "myfiles"
---
  def index
    @myfiles = Myfile.all.order('created_at DESC')
    @count_files = @myfiles.count

INSERT INTO "myfiles" ("name", "attachment", "created_at", "updated_at", "user_id", "size") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "CrystalReport1.vb"], ["attachment", "CrystalReport1.vb"], ["created_at", "2018-06-10 11:35:32.030242"], ["updated_at", "2018-06-10 11:35:32.030242"], ["user_id", 1], ["size", 5586]]
---
 def create


      params[:item_files]['file'].each do |f|
        @myfile = Myfile.new
        @myfile.attachment = f
        # take array string by split
        str = @myfile.attachment.to_s.split('/')
        @myfile.name = str[str.count-1]
        @myfile.size = @myfile.attachment.size
        @myfile.user_id = current_user.id
        @myfile.save

SELECT  "myfiles".* FROM "myfiles" WHERE "myfiles"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]
DELETE FROM "myfiles" WHERE "myfiles"."id" = $1  [["id", 75]]
---
 def destroy
    @myfile = Myfile.find(params[:id])
    @myfile.destroy